app/controllers/home_controller.rb

SELECT * FROM `friends` WHERE (`friends`.user_id = 1 AND (first_name IS NULL)) LIMIT 1
SELECT count(DISTINCT `friends`.id) AS count_all FROM `friends` LEFT OUTER JOIN `movies` ON movies.friend_id = friends.id LEFT OUTER JOIN `musics` ON musics.friend_id = friends.id LEFT OUTER JOIN `books` ON books.friend_id = friends.id WHERE (`friends`.user_id = 1)
---
  def index
    if params[:signed_request]
      begin
        signed_request = parse_signed_request(params, oauth_secret("facebook"))
        if signed_request["user_id"]
          session[:signed_request] = params[:signed_request]
          session[:user_id] = signed_request["user_id"]

          get_friends(current_user, current_user.fb_uid)# if current_user.friends.empty?